read_verilog -sv -formal -overwrite {workspace}/user/src/controller.v
design -reset-vlog; proc;
write_json {workspace}/prj/netlist/controller.json