# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name FF -cap_table {/usr/local-eit/cad2/cmpstm/stm065v536/EncounterTechnoKit_cmos065_7m4x0y2z_AP@5.3.1/TECH/cmos065_7m4x0y2z_AP_Best.captable} -T {-40} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {0.0} -postRoute_clkcap {0.0} -qx_tech_file {/usr/local-eit/cad2/cmpstm/stm065v536/SignOffTechnoKit_cmos065lp_7m4x0y2z@5.3.4/etc/QrcTechLibs/RCMAX/qrcTechFile}
create_rc_corner -name SS -cap_table {/usr/local-eit/cad2/cmpstm/stm065v536/EncounterTechnoKit_cmos065_7m4x0y2z_AP@5.3.1/TECH/cmos065_7m4x0y2z_AP_Worst.captable} -T {125} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {0.0} -postRoute_clkcap {0.0} -qx_tech_file {/usr/local-eit/cad2/cmpstm/stm065v536/SignOffTechnoKit_cmos065lp_7m4x0y2z@5.3.4/etc/QrcTechLibs/RCMIN/qrcTechFile}
create_op_cond -name BCCOM -library_file {/usr/local-eit/cad2/cmpstm/stm065v536/CORE65LPLVT_5.1/libs/CORE65LPLVT_bc_1.30V_m40C.lib} -P {1.0} -V {1.3} -T {-40}
create_op_cond -name WCCOM -library_file {/usr/local-eit/cad2/cmpstm/stm065v536/CORE65LPLVT_5.1/libs/CORE65LPLVT_wc_1.10V_125C_10y.lib} -P {1.0} -V {1.1} -T {125}
create_library_set -name FF -timing {/usr/local-eit/cad2/cmpstm/stm065v536/CORE65LPLVT_5.1/libs/CORE65LPLVT_bc_1.30V_m40C.lib /usr/local-eit/cad2/cmpstm/stm065v536/CLOCK65LPLVT_3.1/libs/CLOCK65LPLVT_bc_1.30V_m40C.lib /usr/local-eit/cad2/cmpstm/dicp18/lu_pads_65nm/Pads_Oct2012.lib /usr/local-eit/cad2/cmpstm/oldmems/mem2010/SPHDL100909-40446@1.0/libs/SPHDL100909_bc_1.30V_m40C.lib}
create_library_set -name SS -timing {/usr/local-eit/cad2/cmpstm/dicp18/lu_pads_65nm/Pads_Oct2012.lib /usr/local-eit/cad2/cmpstm/stm065v536/CLOCK65LPLVT_3.1/libs/CLOCK65LPLVT_wc_1.10V_125C_10y.lib /usr/local-eit/cad2/cmpstm/stm065v536/CORE65LPLVT_5.1/libs/CORE65LPLVT_wc_1.10V_125C_10y.lib /usr/local-eit/cad2/cmpstm/oldmems/mem2010/SPHDL100909-40446@1.0/libs/SPHDL100909_wc_1.10V_125C_10y.lib}
create_constraint_mode -name Clock_Contrains -sdc_files {source_files/pulpino_top_rtl_w_pads.sdc}
create_delay_corner -name FF -library_set {FF} -opcond_library {/usr/local-eit/cad2/cmpstm/stm065v536/CORE65LPLVT_5.1/libs/CORE65LPLVT_bc_1.30V_m40C.lib} -opcond {BCCOM} -rc_corner {FF}
create_delay_corner -name SS -library_set {SS} -opcond_library {WCCOM} -opcond {/usr/local-eit/cad2/cmpstm/stm065v536/CORE65LPLVT_5.1/libs/CORE65LPLVT_wc_1.10V_125C_10y.lib} -rc_corner {SS}
create_analysis_view -name FF -constraint_mode {Clock_Contrains} -delay_corner {FF}
create_analysis_view -name SS -constraint_mode {Clock_Contrains} -delay_corner {FF}
set_analysis_view -setup {SS} -hold {SS}
