# ####################################################################

#  Created by Genus(TM) Synthesis Solution 16.12-s027_1 on Mon May 05 19:44:42 +0200 2025

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design pulpino_top_rtl_w_pads

create_clock -name "s_clk" -add -period 40.0 -waveform {0.0 20.0} [get_ports s_clk]
set_clock_transition -max 0.2 [get_clocks s_clk]
create_clock -name "spi_sck" -add -period 100.0 -waveform {0.0 50.0} [get_ports spi_sck]
set_clock_transition -max 0.2 [get_clocks spi_sck]
create_clock -name "jtag_tck" -add -period 100.0 -waveform {0.0 50.0} [get_ports jtag_tck]
set_clock_transition -max 0.2 [get_clocks jtag_tck]
set_clock_groups -asynchronous -group [get_clocks s_clk] -group [get_clocks spi_sck] -group [get_clocks jtag_tck]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks s_clk] -add_delay 0.5 [get_ports uart_rx]
set_input_delay -clock [get_clocks s_clk] -add_delay 0.5 [get_ports s_rst_n]
set_input_delay -clock [get_clocks s_clk] -add_delay 0.5 [get_ports s_clk]
set_input_delay -clock [get_clocks s_clk] -add_delay 0.5 [get_ports fetch_enable]
set_output_delay -clock [get_clocks s_clk] -add_delay 0.5 [get_ports s_uart_dtr]
set_output_delay -clock [get_clocks s_clk] -add_delay 0.5 [get_ports s_uart_rts]
set_output_delay -clock [get_clocks s_clk] -add_delay 0.5 [get_ports uart_tx]
set_output_delay -clock [get_clocks s_clk] -add_delay 0.5 [get_ports gpio_out8]
set_input_delay -clock [get_clocks spi_sck] -add_delay 0.5 [get_ports spi_sdi3]
set_input_delay -clock [get_clocks spi_sck] -add_delay 0.5 [get_ports spi_sdi2]
set_input_delay -clock [get_clocks spi_sck] -add_delay 0.5 [get_ports spi_sdi1]
set_input_delay -clock [get_clocks spi_sck] -add_delay 0.5 [get_ports spi_sdi0]
set_input_delay -clock [get_clocks spi_sck] -add_delay 0.5 [get_ports spi_csn]
set_input_delay -clock [get_clocks spi_sck] -add_delay 0.5 [get_ports spi_sck]
set_output_delay -clock [get_clocks spi_sck] -add_delay 0.5 [get_ports spi_sdo3]
set_output_delay -clock [get_clocks spi_sck] -add_delay 0.5 [get_ports spi_sdo2]
set_output_delay -clock [get_clocks spi_sck] -add_delay 0.5 [get_ports spi_sdo1]
set_output_delay -clock [get_clocks spi_sck] -add_delay 0.5 [get_ports spi_sdo0]
set_output_delay -clock [get_clocks spi_sck] -add_delay 0.5 [get_ports {spi_mode[0]}]
set_output_delay -clock [get_clocks spi_sck] -add_delay 0.5 [get_ports {spi_mode[1]}]
set_input_delay -clock [get_clocks jtag_tck] -add_delay 0.5 [get_ports jtag_tdi]
set_input_delay -clock [get_clocks jtag_tck] -add_delay 0.5 [get_ports jtag_tms]
set_input_delay -clock [get_clocks jtag_tck] -add_delay 0.5 [get_ports jtag_trstn]
set_input_delay -clock [get_clocks jtag_tck] -add_delay 0.5 [get_ports jtag_tck]
set_output_delay -clock [get_clocks jtag_tck] -add_delay 0.5 [get_ports jtag_tdo]
set_wire_load_mode "enclosed"
set_wire_load_selection_group "default_by_area" -library "CLOCK65LPLVT"
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LLP_CNHLSX10]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LLP_CNHLSX14]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LLP_CNHLSX17]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LLP_CNHLSX21]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LLP_CNHLSX24]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LLP_CNHLSX27]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LLP_CNHLSX31]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LLP_CNHLSX34]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LLP_CNHLSX38]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LLP_CNHLSX41]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LLP_CNHLSX52]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LLP_CNHLSX62]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LLP_CNHLSX7]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LLP_CNHLSX82]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CAPX18]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CAPX35]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CAPX53]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CAPX9]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_0]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_1]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_10]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_11]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_12]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_13]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_14]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_15]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_16]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_17]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_18]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_19]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_2]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_20]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_21]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_22]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_23]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_3]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_4]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_5]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_6]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_7]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_8]
set_dont_use [get_lib_cells CLOCK65LPLVT/HS65_LL_CNBFX38_9]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_BK1SX1]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_BK1X1]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPHQNX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPHQNX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPHQNX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPHQX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPHQX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPHQX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPQNX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPQNX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPQNX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPQX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPQX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPQX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPRQNX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPRQNX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPRQNX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPRQX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPRQX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPRQX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPSQNX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPSQNX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPSQNX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPSQX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPSQX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_DFPSQX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPBTQX9]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHQNTX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHQNTX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHQNTX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHQNX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHQNX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHQNX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHQTX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHQTX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHQTX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHQX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHQX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHQX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHRQNTX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHRQNTX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHRQNTX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHRQTX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHRQTX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPHRQTX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPQNTX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPQNTX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPQNTX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPQNX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPQNX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPQNX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPQTX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPQTX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPQTX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPQX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPQX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPQX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPRQNTX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPRQNTX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPRQNTX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPRQNX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPRQNX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPRQNX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPRQTX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPRQTX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPRQTX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPRQX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPRQX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPRQX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPSQNTX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPSQNTX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPSQNTX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPSQNX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPSQNX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPSQNX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPSQTX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPSQTX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPSQTX35]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPSQX18]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPSQX27]
set_dont_use [get_lib_cells CORE65LPLVT/HS65_LL_SDFPSQX35]
set_dont_use [get_lib_cells SPHDL100909/ST_SPHDL_1024x8m8_L]
set_dont_use [get_lib_cells SPHDL100909/ST_SPHDL_2048x8m8_L]
set_dont_use [get_lib_cells PAD/CPAD_S_74x50u_IN]
set_dont_use [get_lib_cells PAD/CPAD_S_74x50u_OUT]
set_clock_latency -max 0.5 [get_ports s_clk]
set_clock_latency -source -max 0.5 [get_ports s_clk]
set_clock_uncertainty -setup 0.5 [get_ports s_clk]
set_clock_uncertainty -hold 0.5 [get_ports s_clk]
set_clock_latency -max 0.5 [get_ports spi_sck]
set_clock_latency -source -max 0.5 [get_ports spi_sck]
set_clock_uncertainty -setup 0.5 [get_ports spi_sck]
set_clock_uncertainty -hold 0.5 [get_ports spi_sck]
set_clock_latency -max 0.5 [get_ports jtag_tck]
set_clock_latency -source -max 0.5 [get_ports jtag_tck]
set_clock_uncertainty -setup 0.5 [get_ports jtag_tck]
set_clock_uncertainty -hold 0.5 [get_ports jtag_tck]
